test/ConteMesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*libs (
   "libOpenFOAM.so"
   "libgroovyBC.so"
   "libsimpleSwakFunctionObjects.so"
   "libswakFunctionObjects.so"
   "libfieldFunctionObjects.so"
   "libswakThermoTurbFunctionPlugin.so"
);
*/

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;//nextWrite;

endTime         0.021;

deltaT         1e-07;

writeControl    adjustableRunTime;

writeInterval  $deltaT;//1e-05;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.7;

//maxDeltaT       1;



/*
functions
{
    

    residuals
    {
        type           residuals;
        functionObjectLibs ("libutilityFunctionObjects.so");
        enabled        true;
    writeControl   timeStep;
        writeInterval  1;
        fields
        (
            U
            p
		e
		omega
		k
        );
    }
}; */


libs (
"libmyfluidThermophysicalModels.so"
);


// ************************************************************************* //
