test/ConteMesh/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (0 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{
    "(outlet|side)"
    {   
        type            inletOutlet;
        inletValue      uniform $Uinlet;
        value           uniform $Uinlet;
        //type            fixedValue;
        //value uniform $Uinlet;
    }

    wall
    {
        type            noSlip;
    }

    //#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
