test/ConteMesh/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;//leastSquares;   
    grad(U)	        $default;//cellLimited leastSquares 1.0;   //default

}

divSchemes
{
    default         none;
    div(phi,U)      Gauss upwind;//MinmodV; //Gauss limitedLinearV 1;

    div(phiv,p)     Gauss limitedLinear 1; //Gauss linear;
    div(phi,e)      Gauss limitedLinear 1; //Gauss linear;
    div(phi,K)      Gauss limitedLinear 1; //Gauss linear;
    div(phi,h)      Gauss limitedLinear 1; //Gauss linear;

    div(phi,k)      Gauss limitedLinear 1;
    div(phi,epsilon) Gauss limitedLinear 1;
    div(phi,R)      Gauss limitedLinear 1;
    div(phi,omega)  Gauss limitedLinear 1;


    div((rho*R))    Gauss limitedLinear 1; //Gauss linear;
    div(R)          Gauss limitedLinear 1; //Gauss linear;
    div(U)          Gauss limitedLinear 1; //Gauss linear;
   

    div(((rho*nuEff)*dev2(T(grad(U)))))	Gauss linear;  
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}



wallDist
{
    method meshWave;
}

// ************************************************************************* //
