test/ConteMesh/system/dati_MESH/ELETT_blocks
//TRA ELETTRODI

//Quadrato spicchi
hex (e2_qq e7_qq e8_qq e3_qq e2_0 e7_0 e8_0 e3_0 ) ($en $lo $lo) simpleGrading ($enc $log $log)
hex (e3_qq e8_qq e9_qq e4_qq e3_0 e8_0 e9_0 e4_0 ) ($en $lo   $lo) simpleGrading ($enc $log   $log)

//DOWN
hex (e4_qq e9_qq e10_qq e5_qq e4_0 e9_0 e10_0 e5_0 ) ($en $lo $lo) simpleGrading ($enc $log $log)
hex ( e5_qq e10_qq e11_qq e6_qq e5_0 e10_0 e11_0 e6_0  ) ($en $lo  $lo) simpleGrading ( $enc $log $log)


//CERCHIO
hex (e12_qq e2_qq e3_qq e13_qq e12_0 e2_0 e3_0 e13_0 ) ($ccc  $lo $lo) simpleGrading ($cccg $log $log)
hex (e13_qq e3_qq e4_qq e14_qq e13_0 e3_0 e4_0 e14_0 ) ($ccc  $lo $lo) simpleGrading ($cccg $log $log)
hex (e14_qq e4_qq e5_qq e15_qq e14_0 e4_0 e5_0 e15_0 ) ($ccc  $lo $lo) simpleGrading ($cccg $log $log)
hex (e15_qq e5_qq e6_qq e16_qq e15_0 e5_0 e6_0 e16_0 ) ($ccc  $lo $lo) simpleGrading ($cccg $log $log)

//OTTAGONO
hex (e1_qq e12_qq e13_qq e14_qq e1_0 e12_0 e13_0 e14_0  ) ($lo $lo  $lo) simpleGrading ($log $log $log)
hex (e1_qq e14_qq e15_qq e16_qq e1_0 e14_0 e15_0 e16_0  ) ($lo $lo  $lo) simpleGrading ($log $log $log)



//ESTERNO
hex ( e2_qq e3_qq e8_qq e7_qq e2_c e3_c v12_4 v13_4   ) ( $lo $en $N3) simpleGrading ( $log $enc $N3g)

hex ( e3_qq e4_qq e9_qq e8_qq e3_c e4_c v12_3 v12_4 ) ($lo $en    $N3) simpleGrading ( $log $enc $N3g)


//DOWN
hex (e5_qq e10_qq e9_qq e4_qq  e5_c v12_2 v12_3   e4_c ) ( $en $lo   $N3) simpleGrading ( $enc $log   $N3g)

hex (e6_qq e11_qq e10_qq e5_qq e6_c v13_2 v12_2 e5_c) ($en $lo     $N3) simpleGrading ($enc $log  $N3g)