test/ConteMesh/system/dati_MESH/INTERNO_blocks
//PRIMO PIANO INTERNO

//Ott
hex (v3_6 v2_6 v1_6 v4_6 v3_7 v2_7 v1_7 v4_7 ) ($lo $lo $L7) simpleGrading ($log $log $L7g)     

//Circ interna
hex (v3_6 v7_6 v6_6 v2_6 v3_7 v7_7 v6_7 v2_7) ($N1 $lo $L7) simpleGrading ($N1g $log $L7g)     
hex (v2_6 v6_6 v5_6 v1_6 v2_7 v6_7 v5_7 v1_7) ($N1 $lo $L7) simpleGrading ($N1g $log $L7g) 


//Circ interna1
hex (v7_6 v10_6 v9_6 v6_6 v7_7 v10_7 v9_7 v6_7) ($N2 $lo $L7) simpleGrading ($N2g $log $L7g)     
hex (v6_6 v9_6 v8_6 v5_6 v6_7 v9_7 v8_7 v5_7)   ($N2 $lo $L7) simpleGrading ($N2g $log $L7g) 



//Circ esterna2
hex (v10_6 v13_6 v12_6 v9_6 v10_7 v13_7 v12_7 v9_7) ($N3 $lo $L7) simpleGrading ($N3g $log $L7g)     
hex (v9_6 v12_6 v11_6 v8_6 v9_7 v12_7 v11_7 v8_7) ($N3 $lo $L7) simpleGrading ($N3g $log $L7g)  





//INTERNO DOPO SFERA

//Quadrato
hex (e7_0 e7_qq e8_qq e8_0 c4 c3 cdd cc3) ($lo $lo $L5) simpleGrading ($log $log $L5g)
//Circ esterna2
hex (e7_qq v13_4 v12_4 e8_qq c3 v13_5 v12_5 cdd) ($N3 $lo $L5) simpleGrading ($N3g $log $L5g)     
hex (e8_qq v12_4 v11_4 e8_0 cdd v12_5 v11_5 cc3) ($N3 $lo $L5) simpleGrading ($N3g $log $L5g)  



//PIANO ELETTRODI
//Circ esterna2
hex (e9_qq v12_3 v11_3 e9_0 e8_qq v12_4 v11_4 e8_0) ($N3 $lo $lo) simpleGrading ($N3g $log $log)   

//Circ esterna2
hex (e10_qq v12_2 v11_2 e10_0 e9_qq v12_3 v11_3 e9_0) ($N3 $lo $lo) simpleGrading ($N3g $log $log)   






//SOTTO ELETTRODI
//Quadrato
hex (v4_1 v3_1 v2_1 v1_1 e11_0 e11_qq e10_qq e10_0) ($lo $lo $L1) simpleGrading ($log $log $L1g)
//Circ esterna2
hex (v3_1 v13_1 v12_1 v2_1 e11_qq v13_2 v12_2 e10_qq) ($N3 $lo $L1) simpleGrading ($N3g $log $L1g)     
hex (v2_1 v12_1 v11_1 v1_1 e10_qq v12_2 v11_2 e10_0) ($N3 $lo $L1) simpleGrading ($N3g $log $L1g)  





