test/ConteMesh/system/dati_MESH/INTERNO_edges
// ************************* INTERNO*******************************


//TOP CAVITY
project   v8_7 v9_7  (cilindro_INTERNO1)
project   v9_7 v10_7  (cilindro_INTERNO1)


//Cilindro intenro primo piano


//inlet nozzle
project   v5_6 v6_6  (cilindro_INTERNO)
project   v6_6 v7_6  (cilindro_INTERNO)



//circonferenza interna 1
project   v8_6 v9_6  (cilindro_INTERNO1)
project   v9_6 v10_6  (cilindro_INTERNO1)

//Cavità

//INGRESSO
project   v11_7 v12_7  (CAVITA)
project   v12_7 v13_7  (CAVITA)

//A -Z1
project   v11_6 v12_6  (CAVITA)
project   v12_6 v13_6  (CAVITA)





//DOPO SFERA

//INLET 4
project   v11_4 v12_4  (CAVITA)
project   v12_4 v13_4  (CAVITA)


project   v12_3 v11_3  (CAVITA)
project   v12_2 v11_2  (CAVITA)



//TERRA
project   v12_1 v11_1  (CAVITA)
project   v12_1 v13_1  (CAVITA)

      



