test/ConteMesh/system/dati_MESH/dati_blocchi_elettrodi

// diagonale elettrodi
en 8;
enc 2;


//diagonale cerchio 
ccc 4; 

cccg 1.4;