test/ConteMesh/system/fvOptions.wip
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

codedSource
{   
    active          false;
    type            scalarCodedSource;
    selectionMode   region;
    name            interElectrodes;

    fields          (h);
    name            sourceTime;

    codeAddSup
    #{
        const Time& time = mesh().time();
        const scalarField& V = mesh_.V();
        scalarField& heSource = eqn.source();
       
        const scalar N = 934;
        const scalar timeArray[N]={
                     #include "../data/time.H"    
                    };
        const scalar SourceArray[N]={
                     #include "../data/source.H"    
                    };

        // Start time
        const scalar endTime = timeArray[N-1];

        // Retrieve the x component of the cell centres
        const scalarField& cellx = mesh_.C().component(0);

        // Only apply when we have reached the start time
        if (time.value() < endTime)
        {
            // Apply the source
            forAll(cellx, i)
            {
                // cell volume specific source
                heSource[i] += 
            };
        } else {
            
        }
    #};
}


// ************************************************************************* //

